Revit 2027 API
BuiltInFailures.StairRampFailures.StairsRunRunJoinNotAllowedFailure Property
 Run-Run join is not allowed of they have same "Start With Riser"/"End With Riser" configuration at the joined end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsRunRunJoinNotAllowedFailure { get; }
Public Shared ReadOnly Property StairsRunRunJoinNotAllowedFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsRunRunJoinNotAllowedFailure {
	FailureDefinitionId^ get ();
}
static member StairsRunRunJoinNotAllowedFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace